# Pandas:

In [1]:
name='hello'
print(type(name))

<class 'str'>

In [3]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'1.3.4'

In [2]:
pd.

['In',
 'Out',
 '_',
 '_1',
 '__',
 '___',
 '__builtin__',
 '__builtins__',
 '__doc__',
 '__loader__',
 '__name__',
 '__package__',
 '__spec__',
 '_dh',
 '_i',
 '_i1',
 '_i2',
 '_ih',
 '_ii',
 '_iii',
 '_oh',
 'exit',
 'get_ipython',
 'quit']

## Series:

In [ ]:
## A series is always a 1-d array.

In [4]:
# making random series

In [4]:
s1= pd.Series([np.arange(1,21)])       ## make series Using np arange method, can also random.randint mehtod
s1

0    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14...
dtype: object

In [21]:
# series with numpy linspace(a,b,i)  a-1st no b-last no i=no of division

In [6]:
pd.Series(np.linspace(2,20,10))

0     2.0
1     4.0
2     6.0
3     8.0
4    10.0
5    12.0
6    14.0
7    16.0
8    18.0
9    20.0
dtype: float64

In [16]:
s =pd.Series([12,33,44])

In [17]:
s

0    12
1    33
2    44
dtype: int64

In [18]:
type(s)

pandas.core.series.Series

In [19]:
s.dtype

dtype('int64')

In [20]:
s =pd.Series([12,33,'r',44])     # a series can have difft. dtatype

In [21]:
s

0    12
1    33
2     r
3    44
dtype: object

In [23]:
s.dtype

dtype('O')

In [32]:
s =pd.Series([12,33,44,55,66])
s

0    12
1    33
2    44
3    55
4    66
dtype: int64

In [33]:
s.values

array([12, 33, 44, 55, 66], dtype=int64)

In [34]:
s.index

RangeIndex(start=0, stop=5, step=1)

INDEXING in SERIES

In [35]:
s[1]

33

In [36]:
s[1:]

1    33
2    44
3    55
4    66
dtype: int64

In [42]:
s[[4,1]]

4    66
1    33
dtype: int64

FILTERING IN SEREIS

In [44]:
s>35

0    False
1    False
2     True
3     True
4     True
dtype: bool

In [40]:
s[s>35]

2    44
3    55
4    66
dtype: int64

In [5]:
s =pd.Series([12,33,44,55,66],index=['a','b','c','d','e'])         ## Series by with manual index value
s

a    12
b    33
c    44
d    55
e    66
dtype: int64

In [46]:
s.values

array([12, 33, 44, 55, 66], dtype=int64)

In [47]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [48]:
s['a']

12

In [49]:
s[0]

12

In [50]:
s['b':]

b    33
c    44
d    55
e    66
dtype: int64

In [52]:
s[1:3]

b    33
c    44
dtype: int64

In [53]:
s['b':'d']

b    33
c    44
d    55
dtype: int64

In [54]:
s[['e','b']]

e    66
b    33
dtype: int64

In [2]:
s =pd.Series([12,33,44,55,66],index=['c','d','e','a','b'])
s

c    12
d    33
e    44
a    55
b    66
dtype: int64

In [59]:
s['a':'c']

Series([], dtype: int64)

In [5]:
sr=s.reindex(['a','b','c','d','e'])
sr

a    55
b    66
c    12
d    33
e    44
dtype: int64

In [170]:
s =pd.Series([12,33,44,55,66],index=['c','a','e','a','b'])
s

c    12
a    33
e    44
a    55
b    66
dtype: int64

In [171]:
s['a']

a    33
a    55
dtype: int64

In [173]:
'b' in s

True

In [174]:
'x' in s

False

In [177]:
s.isin([33])

c    False
a     True
e    False
a    False
b    False
dtype: bool

In [178]:
s[s.isin([33])]

a    33
dtype: int64

s.isin([33,55])

In [180]:
s.isin([33,88])

c    False
a     True
e    False
a    False
b    False
dtype: bool

In [172]:
s**2

c     144
a    1089
e    1936
a    3025
b    4356
dtype: int64

In [ ]:
## Series by dictionary``

In [80]:
d ={'aditya':33, 'saket':25,'rohan':26,'umar':23}

In [81]:
s =pd.Series(d)
s

aditya    33
saket     25
rohan     26
umar      23
dtype: int64

In [82]:
s.values

array([33, 25, 26, 23], dtype=int64)

In [83]:
s.index

Index(['aditya', 'saket', 'rohan', 'umar'], dtype='object')

In [84]:
s['saket']

25

In [86]:
s =pd.Series({'aditya':33, 'saket':25,'rohan':26,'umar':23},index=['saket','rohan'])
s

saket    25
rohan    26
dtype: int64

In [88]:
s =pd.Series({'aditya':33, 'saket':25,'rohan':26,'umar':23},index=['saket','rohan','blesson'])
s

saket      25.0
rohan      26.0
blesson     NaN
dtype: float64

In [91]:
s.isna()
#s.isnull()

saket      False
rohan      False
blesson     True
dtype: bool

In [94]:
s.notna()
#s.notnull()

saket       True
rohan       True
blesson    False
dtype: bool

In [2]:
s_age= pd.Series([33,26,26,23],index=['Aditya','Saket','Rohan','Umar'])

In [3]:
s_age

Aditya    33
Saket     26
Rohan     26
Umar      23
dtype: int64

In [4]:
s_age[1]

26

In [186]:
s_age.iloc[1]

26

In [187]:
s_age['Saket']

26

In [190]:
s_age.loc['Saket']

26

## DataFrame:

In [ ]:
## It is 2-axis represent.

In [1]:
## Dataframe by manual data enter

In [55]:
df =pd.DataFrame([[12,34,56],[34,56,77]])
df

    0   1   2
0  12  34  56
1  34  56  77

In [57]:
df[1] # df[1,2] error

0    34
1    56
Name: 1, dtype: int64

In [104]:
type(df)

pandas.core.frame.DataFrame

In [105]:
df.dtypes

0    int64
1    int64
2    int64
dtype: object

In [27]:
## dataframe using random int 

df= pd.DataFrame(np.random.randint(5,245,(4,5)),index= ['r1','r2','r3','r4'], columns=['c1','c2','c3','c4','c5'])
df          # np.random.randint(min,max,(shape))

     c1   c2   c3   c4   c5
r1  159  221  105    9   28
r2  189  239   19  121   94
r3  169   80  148  164   10
r4  151   95  219  136  225

In [ ]:
## Datafrme by numpy arange

In [12]:
pd.DataFrame(np.arange(1,13).reshape(3,4))

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [ ]:
## Using Dictionary

In [63]:
df1= pd.DataFrame({'name':['aditya','sachin','rahul','virendra'],
             'age':[33,44,32,41],
             'location':['ujjain','mumbai','indore','delhi']})
df1['id']=['a','b','c','d']
# dframe havin charactr colm. numeric indexin df[3,3] not done loc,iloc used insted

In [26]:
df1

       name  age location id
0    aditya   33   ujjain  a
1    sachin   44   mumbai  b
2     rahul   32   indore  c
3  virendra   41    delhi  d

In [64]:
df1.set_index('id')  # making index by existing colm
df1.

        name  age location
id
a     aditya   33   ujjain
b     sachin   44   mumbai
c      rahul   32   indore
d   virendra   41    delhi

In [66]:
df1[1:]   # dataframe with (num,charactr index) df[2]error, df[0:1,]error

       name  age location id
1    sachin   44   mumbai  b
2     rahul   32   indore  c
3  virendra   41    delhi  d

In [67]:
df1[0:]['age']

0    33
1    44
2    32
3    41
Name: age, dtype: int64

In [58]:
# s_age = pd.Series({'Aditya':33,'Saket':26,'Rohan':26,'Umar':23})
s_age= pd.Series([33,26,26,23],index=['Aditya','Saket','Rohan','Umar'])

In [59]:
s_age

Aditya    33
Saket     26
Rohan     26
Umar      23
dtype: int64

In [60]:
# s_location = pd.Series({'Aditya':'Indore','Saket':'Bareilly','Rohan':'Madras','Umar':'Ranchi'})
s_location= pd.Series(['Indore','Bareilly','Madras','Ranchi'],index=['Aditya','Saket','Rohan','Umar'])

In [61]:
s_location

Aditya      Indore
Saket     Bareilly
Rohan       Madras
Umar        Ranchi
dtype: object

In [62]:
pd.DataFrame({'age':s_age, 'location':s_location})

        age  location
Aditya   33    Indore
Saket    26  Bareilly
Rohan    26    Madras
Umar     23    Ranchi

In [63]:
import pandas as pd
import numpy as np

In [28]:
s_age= pd.Series([33,26,26,23,45],index=['Aditya','Saket','Rohan','Umar','sachin'])

In [65]:
s_age

Aditya    33
Saket     26
Rohan     26
Umar      23
sachin    45
dtype: int64

In [29]:
s_location= pd.Series(['Indore','Bareilly','Madras','Ranchi','varoda'],index=['Aditya','Saket','Rohan','Umar','rahul'])

In [67]:
s_location

Aditya      Indore
Saket     Bareilly
Rohan       Madras
Umar        Ranchi
rahul       varoda
dtype: object

In [58]:
dfseries=pd.DataFrame({'age':s_age, 'location':s_location})

dfseries

         age  location
Aditya  33.0    Indore
Rohan   26.0    Madras
Saket   26.0  Bareilly
Umar    23.0    Ranchi
rahul    NaN    varoda
sachin  45.0       NaN

In [46]:
dfseries[0:]

         age  location
Aditya  33.0    Indore
Rohan   26.0    Madras
Saket   26.0  Bareilly
Umar    23.0    Ranchi
rahul    NaN    varoda
sachin  45.0       NaN

### deaaling with colm. using indexing df[index rows] by default, df[colm name]
### Dealing with Columns
In order to deal with columns, we perform basic operations on columns like selecting, deleting, adding and renaming.

In [2]:
import pandas as pd
import numpy as np

In [3]:
df1= pd.DataFrame({'name':['aditya','sachin','rahul','virendra'],
             'age':[33,44,32,41],
             'location':['ujjain','mumbai','indore','delhi']})
df1['id']=['a','b','c','d']

In [4]:
df1

       name  age location id
0    aditya   33   ujjain  a
1    sachin   44   mumbai  b
2     rahul   32   indore  c
3  virendra   41    delhi  d

In [20]:
df1[0:3]

     name  age location id
0  aditya   33   ujjain  a
1  sachin   44   mumbai  b
2   rahul   32   indore  c

In [21]:
#1. accesing both colm rows in dataframe, without loc/iloc (rows of parti. colm.)
df1[:3]['age']

0    33
1    44
2    32
Name: age, dtype: int64

In [22]:
df1[df1 ['age']>25]   # filterin data

       name  age location id
0    aditya   33   ujjain  a
1    sachin   44   mumbai  b
2     rahul   32   indore  c
3  virendra   41    delhi  d

In [4]:
## Inserting colm. at location df(colm.index.posi ,' colmname','value')

df1.insert(1,'job',['Data engineer','ML eng',' DA','DEng'])
df1

       name            job  age location id
0    aditya  Data engineer   33   ujjain  a
1    sachin         ML eng   44   mumbai  b
2     rahul             DA   32   indore  c
3  virendra           DEng   41    delhi  d

In [11]:
## adding colm. end

df1['qualification']='btech'

In [16]:
df1

       name            job  age location id qualification
0    aditya  Data engineer   33   ujjain  a         btech
1    sachin         ML eng   44   mumbai  b         btech
2     rahul             DA   32   indore  c         btech
3  virendra           DEng   41    delhi  d         btech

In [56]:
df2=df1.set_index('name')
df2

                    job  age location id qualification
name
aditya    Data engineer   33   ujjain  a         btech
sachin           ML eng   44   mumbai  b         btech
rahul                DA   32   indore  c         btech
virendra           DEng   41    delhi  d         btech

In [57]:
# deleting rows  df1.drop(indexno.of row)

df1.drop(labels=1)  # df.drop(labels=[3,4,6]) or (labels=['adiya','rahul'])
df2.drop(labels='sachin')

                    job  age location id qualification
name
aditya    Data engineer   33   ujjain  a         btech
rahul                DA   32   indore  c         btech
virendra           DEng   41    delhi  d         btech

In [39]:
df1.drop(index=[0,1])    # df.drop(index=[0:3])

       name   job  age location id qualification
2     rahul    DA   32   indore  c         btech
3  virendra  DEng   41    delhi  d         btech

In [43]:
df2.drop(index=['aditya','rahul'])   # row deltion usin index name

             job  age location id qualification
name
sachin    ML eng   44   mumbai  b         btech
virendra    DEng   41    delhi  d         btech

In [12]:
df1

       name            job  age location id qualification
0    aditya  Data engineer   33   ujjain  a         btech
1    sachin         ML eng   44   mumbai  b         btech
2     rahul             DA   32   indore  c         btech
3  virendra           DEng   41    delhi  d         btech

In [13]:
## Colm deltion 

df1.drop(labels=["qualification"], axis = 1, inplace = True)      # for axis =0 rows can b deleted
df1

       name            job  age location id
0    aditya  Data engineer   33   ujjain  a
1    sachin         ML eng   44   mumbai  b
2     rahul             DA   32   indore  c
3  virendra           DEng   41    delhi  d

In [15]:
df1.drop(columns=['id','job'])

       name  age location
0    aditya   33   ujjain
1    sachin   44   mumbai
2     rahul   32   indore
3  virendra   41    delhi

In [58]:
df1

       name            job  age location id qualification
0    aditya  Data engineer   33   ujjain  a         btech
1    sachin         ML eng   44   mumbai  b         btech
2     rahul             DA   32   indore  c         btech
3  virendra           DEng   41    delhi  d         btech

In [5]:
## Renaming colms

df1.rename(columns= {'name': 'firstname'})

  firstname  age location id
0    aditya   33   ujjain  a
1    sachin   44   mumbai  b
2     rahul   32   indore  c
3  virendra   41    delhi  d

### callin

In [63]:
df1.iloc[2,1]

' DA'

In [62]:
df.loc[3,'job']

'DEng'

In [16]:
dfseries

         age  location
Aditya  33.0    Indore
Rohan   26.0    Madras
Saket   26.0  Bareilly
Umar    23.0    Ranchi
rahul    NaN    varoda
sachin  45.0       NaN

## Dealing with Rows:
#In order to deal with rows, we can perform basic operations on rows like selecting, deleting, adding and renaming.

In [ ]:
## df.loc and iloc fn.    to access rows by name/index

In [18]:
# Row Selection:
dfseries.loc[['Aditya']]

         age location
Aditya  33.0   Indore

In [20]:
dfseries.loc['Saket','age']        ##  loc[row,colm.]

26.0

In [ ]:
# iloc fn. to access both row,colm

In [26]:
dfseries.iloc[2,0]

26.0

In [ ]:
dfseries.iloc[]

In [24]:
import pandas as pd
import numpy as np

In [3]:
df =pd.DataFrame(np.random.randint(5,17,(4,4)))
df                     #making random datafrmae frm series usin numpy-pandas randint

    0   1   2   3
0   5  16  15  11
1   7  15  11  16
2   8  13   7   8
3  14  13   9  15

In [17]:
df.iloc[0:3]

   0   1   2  3
0  9  12  16  9
1  6  12  10  8
2  9   7  12  8

In [18]:
df.loc[0,0]

9

In [19]:
df.iloc[[2]]

   0  1   2  3
2  9  7  12  8

In [226]:
df.iloc[[3,1]]

   0   1   2   3
3  6  12   5  16
1  9   7  16   5

In [227]:
df.iloc[:,[3,1]]

    3   1
0   9   6
1   5   7
2  12  15
3  16  12

In [228]:
df.iloc[[2],[3,1]]

    3   1
2  12  15

In [7]:
df.iloc[1]

0     7
1    15
2    11
3    16
Name: 1, dtype: int32

In [20]:
df[df>10]

      0     1     2     3
0   NaN  12.0  16.0   NaN
1   NaN  12.0   NaN   NaN
2   NaN   NaN  12.0   NaN
3  16.0  12.0   NaN  16.0

In [8]:
df

    0   1   2   3
0   5  16  15  11
1   7  15  11  16
2   8  13   7   8
3  14  13   9  15

In [22]:
df[1]>10

0     True
1     True
2    False
3     True
Name: 1, dtype: bool

In [23]:
df[df[1]>10]

    0   1   2   3
0   9  12  16   9
1   6  12  10   8
3  16  12   6  16

In [242]:
df.loc[df[1]>10,[2,1]]    #

    2   1
2  10  15
3   5  12

In [2]:
import pandas as pd

#### dealing with DUPLICATES (row/colms)

In [47]:
#create DataFrame
df = pd.DataFrame({'team': ['A', 'A', 'A', 'A', 'B', 'B', 'B', 'B'],
                   'points': [10, 10, 12, 12, 15, 17, 20, 20],
                   'assists': [5, 5, 7, 9, 12, 9, 6, 6]})

In [52]:
# HOW To fetch duplicate out of dataframe

df[df.duplicated()]  # returns df with only duplicates across the row in ALL COLMS
df[df.duplicated('team')]   # returns df with duplicates in SINGLE team colm

  team  points team  assists
1    A      10    c        5
7    B      20    c        6

In [ ]:
df.drop_duplicates(subset=None, keep='first', inplace=False)    # drop rows having duplicate in all colms
df.drop_duplicates(subset= ['team','points'],)     # delete rows dulicate only on specific colms
#where:

#subset: Which columns to consider for identifying duplicates. Default is all columns.
#keep: Indicates which duplicates (if any) to keep. 
#first: Delete all duplicate rows except first.
#last: Delete all duplicate rows except last.
#False: Delete all duplicates.
#inplace: Indicates whether to drop duplicates in place or return a copy of the DataFrame.

In [48]:
df.insert(2,'team',('c', 'c', 'c', 'b', 'c', 'b','c','c'),allow_duplicates= True)

In [33]:
# finding duplicate colms
df.columns.duplicated(keep= False)
df.columns.value_counts()

team       2
points     1
assists    1
dtype: int64

In [40]:
# returning df with duplicate colm names
df.loc[:,df.columns.duplicated(keep= False)]

  team team
0    a    A
1    b    A
2    b    A
3    c    A
4    c    c
5    d    B

In [55]:
df.T.drop_duplicates().T    # if only all colm_name + all rows are duplicates

          0   1   2   3   4   5   6   7
team      A   A   A   A   B   B   B   B
points   10  10  12  12  15  17  20  20
team      c   c   c   b   c   b   c   c
assists   5   5   7   9  12   9   6   6

In [ ]:
## Row addition 
#In Order to add a Row in Pandas DataFrame, we can concat the old dataframe with new one

# simply concatenate both dataframes

In [4]:
import pandas as pd

In [5]:
df= pd.DataFrame({'name':['aditya','sachin','rahul','virendra'],
             'age':[33,44,32,41],
             'location':['ujjain','mumbai','indore','delhi']})
df

       name  age location
0    aditya   33   ujjain
1    sachin   44   mumbai
2     rahul   32   indore
3  virendra   41    delhi

In [6]:
new_row = pd.DataFrame({'name':['rock'],
                       'age':['44'],
                       'location':['belford']})
new_row

   name age location
0  rock  44  belford

In [7]:
df = pd.concat([new_row, df]).reset_index(drop = True)   # concat and 
df

       name age location
0      rock  44  belford
1    aditya  33   ujjain
2    sachin  44   mumbai
3     rahul  32   indore
4  virendra  41    delhi

In [ ]:
df.loc[df['age']>40,:]

In [10]:
df[df['age']>40]

       name  age location
1    sachin   44   mumbai
3  virendra   41    delhi

In [11]:
df.loc[df['age']>40,['age','name']]             ## loc[rows,colms]

   age      name
1   44    sachin
3   41  virendra

In [13]:
df.iloc[:,[0,1]][df['age']>40][df['name']=='sachin']

C:\Users\hp\AppData\Local\Temp/ipykernel_1632/785422282.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df.iloc[:,[0,1]][df['age']>40][df['name']=='sachin']  ##

     name  age
1  sachin   44

In [8]:
s1 = pd.Series({'adity':33,'sachin':44})

In [9]:
s1

adity     33
sachin    44
dtype: int64

In [10]:
s2 = pd.Series({'adity':33,'sachin':44, 'rahul':35})

In [11]:
s2

adity     33
sachin    44
rahul     35
dtype: int64

In [12]:

s1+s2

adity     66.0
rahul      NaN
sachin    88.0
dtype: float64

In [13]:
df1=pd.DataFrame({'age':[23,56,42]})

In [20]:
df2=pd.DataFrame({'age':[23,56,42]})

In [21]:
df1+df2

   age
0   46
1  112
2   84

In [92]:
df= pd.DataFrame({'age':[33,44,32,41],
             'location':['ujjain','mumbai','indore','delhi']},index=['aditya','sachin','rahul','virendra'])
df

          age location
aditya     33   ujjain
sachin     44   mumbai
rahul      32   indore
virendra   41    delhi

In [49]:
df

          age location  height
aditya     33   ujjain      12
sachin     44   mumbai      12
rahul      32   indore      12
virendra   41    delhi      12

In [19]:
df['height'] = df['age']*4

In [50]:
df['ratio']= df['height']/df['age']

In [51]:
df

          age location  height     ratio
aditya     33   ujjain      12  0.363636
sachin     44   mumbai      12  0.272727
rahul      32   indore      12  0.375000
virendra   41    delhi      12  0.292683

#### Drop colms and rows

In [4]:
df = pd.DataFrame([[12,None,34],[56,66,None],[86,99,77],[23,None,53]],index=['a','b','c','d'],columns=['col1','col2','col3'])
df

   col1  col2  col3
a    12   NaN  34.0
b    56  66.0   NaN
c    86  99.0  77.0
d    23   NaN  53.0

In [10]:
df.drop('a') # rowwise(index_name) default,for colm_name: axis = 1
df.drop('col3', axis= 1)

   col1  col2
a    12   NaN
b    56  66.0
c    86  99.0
d    23   NaN

In [6]:
df.drop(index= 'a',columns= 'col2', )

   col1  col3
b    56   NaN
c    86  77.0
d    23  53.0

# handling missing values

In [76]:
# import numpy as np
# pd.Series([12,34,np.nan,56,67])

In [77]:
s = pd.Series([12,34,None,56,67])

In [78]:
s

0    12.0
1    34.0
2     NaN
3    56.0
4    67.0
dtype: float64

In [80]:
# s.isna()
s.isnull()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [82]:
# s.notna()
s.notnull()

0     True
1     True
2    False
3     True
4     True
dtype: bool

In [83]:
s[s.notna()]

0    12.0
1    34.0
3    56.0
4    67.0
dtype: float64

In [84]:
s[s.isna()]

2   NaN
dtype: float64

In [ ]:
## Handling missing value

In [3]:
import pandas as pd

In [79]:
df = pd.DataFrame([[12,None,34],[56,66,None],[86,99,77],[23,None,53]],index=['a','b','c','d'],columns=['col1','col2','col3'])

In [83]:
df

   col1  col2  col3
a    12   NaN  34.0
b    56  66.0   NaN
c    86  99.0  77.0
d    23   NaN  53.0

In [85]:
df.isna()

    col1   col2   col3
a  False   True  False
b  False  False   True
c  False  False  False
d  False   True  False

In [151]:
df.isna().sum()

col1    0
col2    2
col3    1
dtype: int64

In [152]:
df.isna().any()

col1    False
col2     True
col3     True
dtype: bool

In [98]:
# df.notna()

In [100]:
df['col2'].isna()

a     True
b    False
c    False
d     True
Name: col2, dtype: bool

In [102]:
df[df['col3'].notna()]

   col1  col2  col3
a    12   NaN  34.0
c    86  99.0  77.0
d    23   NaN  53.0

#### deleting null values:

In [133]:
df

   col1  col2  col3
a    12   NaN  34.0
b    56  66.0   NaN
c    86  99.0  77.0
d    23   NaN  53.0

In [134]:
df.dropna()              ## deletes whole colm. that has null .Default- axis=0 row

   col1  col2  col3
c    86  99.0  77.0

In [135]:
df.dropna(axis=1)

   col1
a    12
b    56
c    86
d    23

In [ ]:
df1.dropna

In [136]:
df.dropna(how='all')            ## how=all deltes row only if all elemts. are null

   col1  col2  col3
a    12   NaN  34.0
b    56  66.0   NaN
c    86  99.0  77.0
d    23   NaN  53.0

In [25]:
df2 = pd.DataFrame([[12,None,34,None],[56,66,None,None],[86,99,77,None],[23,None,53,None],[None,None,None,None]],index=['a','b','c','d','e'],columns=['col1','col2','col3','col4'])

df2

   col1  col2  col3  col4
a  12.0   NaN  34.0  None
b  56.0  66.0   NaN  None
c  86.0  99.0  77.0  None
d  23.0   NaN  53.0  None
e   NaN   NaN   NaN  None

In [26]:
df2.dropna(how='all')

   col1  col2  col3  col4
a  12.0   NaN  34.0  None
b  56.0  66.0   NaN  None
c  86.0  99.0  77.0  None
d  23.0   NaN  53.0  None

In [27]:
df2.dropna(how='all',axis=1)

   col1  col2  col3
a  12.0   NaN  34.0
b  56.0  66.0   NaN
c  86.0  99.0  77.0
d  23.0   NaN  53.0
e   NaN   NaN   NaN

In [28]:
df2

   col1  col2  col3  col4
a  12.0   NaN  34.0  None
b  56.0  66.0   NaN  None
c  86.0  99.0  77.0  None
d  23.0   NaN  53.0  None
e   NaN   NaN   NaN  None

In [37]:
df2.dropna(thresh=3)          ## print only that row inwhich 3NotNa vlaue are present

   col1  col2  col3  col4
c  86.0  99.0  77.0  None

In [128]:
df2.dropna(axis=1, thresh=3)

   col1  col3
a  12.0  34.0
b  56.0   NaN
c  86.0  77.0
d  23.0  53.0
e   NaN   NaN

In [130]:
df2

   col1  col2  col3  col4
a  12.0   NaN  34.0  None
b  56.0  66.0   NaN  None
c  86.0  99.0  77.0  None
d  23.0   NaN  53.0  None
e   NaN   NaN   NaN  None

In [40]:
df2.dropna(subset=['col3'],axis=0)        # subset: matrix printed considerin only bbcol3's rows which has Notna value, l

   col1  col2  col3  col4
a  12.0   NaN  34.0  None
c  86.0  99.0  77.0  None
d  23.0   NaN  53.0  None

In [39]:
df2.dropna(subset=['b'],axis=1)

   col1  col2
a  12.0   NaN
b  56.0  66.0
c  86.0  99.0
d  23.0   NaN
e   NaN   NaN

In [132]:
df2.dropna(subset=['col2','col3'])

   col1  col2  col3  col4
c  86.0  99.0  77.0  None

#### fill null values:

In [142]:
df2

   col1  col2  col3  col4
a  12.0   NaN  34.0  None
b  56.0  66.0   NaN  None
c  86.0  99.0  77.0  None
d  23.0   NaN  53.0  None
e   NaN   NaN   NaN  None

In [144]:
df2.fillna(0)                  ## fill value in Na

   col1  col2  col3  col4
a  12.0   0.0  34.0     0
b  56.0  66.0   0.0     0
c  86.0  99.0  77.0     0
d  23.0   0.0  53.0     0
e   0.0   0.0   0.0     0

In [145]:
df2.fillna('X')

   col1  col2  col3 col4
a  12.0     X  34.0    X
b  56.0  66.0     X    X
c  86.0  99.0  77.0    X
d  23.0     X  53.0    X
e     X     X     X    X

In [150]:
df2

   col1  col2  col3  col4
a  12.0   NaN  34.0  None
b  56.0  66.0   NaN  None
c  86.0  99.0  77.0  None
d  23.0   NaN  53.0  None
e   NaN   NaN   NaN  None

In [149]:
df2['col2'].mean()

82.5

In [46]:
df2['col2'].fillna(df2['col2'].mean())

a    82.5
b    66.0
c    99.0
d    82.5
e    82.5
Name: col2, dtype: float64

In [ ]:
df2.fillna(df2['job'].mode())

In [158]:
df.fillna(method='ffill')                 ## forward fill

   col1  col2  col3
a    12   NaN  34.0
b    56  66.0  34.0
c    86  99.0  77.0
d    23  99.0  53.0

In [159]:
df.fillna(method='bfill')                  ## backward fill

   col1  col2  col3
a    12  66.0  34.0
b    56  66.0  77.0
c    86  99.0  77.0
d    23   NaN  53.0

In [10]:
df= pd.DataFrame(np.random.randint(5,15,(4,5)))     ##without index
# df.columns=['c1','c2','c3','c4','c5']

In [169]:
df

    0  1   2   3   4
0  10  7  11   5  10
1  12  6  11  10   5
2   8  5   8  13   7
3  10  5   9  14   8

In [170]:
df + 2               # added to whole each elemt.

    0  1   2   3   4
0  12  9  13   7  12
1  14  8  13  12   7
2  10  7  10  15   9
3  12  7  11  16  10

In [12]:
s1 = pd.Series([3,4,5,6,7])

In [13]:
df + s1                    # each elemt.df add to same index value of series

    0   1   2   3   4
0  12  15  10  19  21
1  12   9  17  17  19
2   8  10  15  11  14
3  13  10  12  14  18

In [2]:
import pandas as pd 
import numpy as np

In [8]:
df2= pd.DataFrame(np.random.randint(2,10,(4,5)),columns=['c1','c2','c3','c4','c5'])   
## df2 with defined colm.

In [7]:
df2
df2['c3'].argmax()
df2['c3'].idxmax()

3

In [33]:
s2= pd.Series([3,4,5,6,7], index=['c1','c2','c3','c4','c5'])

In [34]:
df2 + s2

   c1  c2  c3  c4  c5
0   6  13  12  15   9
1   9  10   7   8  15
2   8  11  12  11   9
3   6  13  10  11  10

In [46]:
df2.get('c3')

0    8
1    2
2    9
3    7
Name: c3, dtype: int32

In [35]:
s3 = pd.Series([3,4,5,6], index=['c1','c2','c3','c4'])

In [36]:
df2 + s               ## s3 only 4 colm so 5th colm shows NaN

    c1    c2    c3    c4  c5
0  6.0  13.0  12.0  15.0 NaN
1  9.0  10.0   7.0   8.0 NaN
2  8.0  11.0  12.0  11.0 NaN
3  6.0  13.0  10.0  11.0 NaN

In [11]:
s4 = pd.Series([3,4,5,6,7], index=['c1','c2','c3','c4','c9'])

c1     3
c2     4
c3     5
c4     6
c9     7
c10    7
dtype: int64

In [38]:
df2 + s4

    c1    c2    c3    c4  c5  c9
0  6.0  13.0  12.0  15.0 NaN NaN
1  9.0  10.0   7.0   8.0 NaN NaN
2  8.0  11.0  12.0  11.0 NaN NaN
3  6.0  13.0  10.0  11.0 NaN NaN

In [213]:
# def fun(x):
#     return x.max()

In [40]:
fun_lam = lambda x : x.max()

In [41]:
df2.apply(fun_lam)

c1    6
c2    9
c3    7
c4    9
c5    8
dtype: int64

In [49]:
fun2=lambda x : x**2

In [51]:
s2.apply(fun2)

c1     9
c2    16
c3    25
c4    36
c5    49
dtype: int64

In [52]:
df2.apply(fun2)

   c1  c2  c3  c4  c5
0   9  81  49  81   4
1  36  36   4   4  64
2  25  49  49  25   4
3   9  81  25  25   9

In [53]:
def fun(x):
    if(x<=5):
        return x**2
    else:
        return x

In [54]:
df2.applymap(fun)

   c1  c2  c3  c4  c5
0   9   9   7   9   4
1   6   6   4   4   8
2  25   7   7  25   4
3   9   9  25  25   9

In [3]:
import pandas as pd
import numpy as np

### Sorting:

In [4]:
s = pd.Series(np.random.randint(2,10,6),index=[2,5,1,3,4,6])

In [5]:
s

2    6
5    6
1    7
3    5
4    4
6    8
dtype: int32

In [19]:
s.sort_index()

1    7
2    7
3    3
4    5
5    5
6    9
dtype: int32

In [40]:
s.sort_index(ascending=False)

6    9
5    5
4    5
3    3
2    7
1    7
dtype: int32

In [20]:
s.sort_values()

3    3
5    5
4    5
2    7
1    7
6    9
dtype: int32

In [41]:
s.sort_values(ascending=False)

6    9
2    7
1    7
5    5
4    5
3    3
dtype: int32

In [6]:
df= pd.DataFrame(np.random.randint(2,50,(4,5)))
df.columns=['c6','c3','c2','c4','c5']

In [43]:
df

   c6  c3  c2  c4  c5
0  47  19  26  38  24
1  41  21  43  21  21
2  17  17  13  45  47
3  19  37   7  17  12

In [44]:
df.sort_index()

   c6  c3  c2  c4  c5
0  47  19  26  38  24
1  41  21  43  21  21
2  17  17  13  45  47
3  19  37   7  17  12

In [45]:
df.sort_index(axis=1)

   c2  c3  c4  c5  c6
0  26  19  38  24  47
1  43  21  21  21  41
2  13  17  45  47  17
3   7  37  17  12  19

In [ ]:
# sorting values by particular colm.

In [46]:
df.sort_values(by='c5')

   c6  c3  c2  c4  c5
3  19  37   7  17  12
1  41  21  43  21  21
0  47  19  26  38  24
2  17  17  13  45  47

In [47]:
df.sort_values(by=['c2'])

   c6  c3  c2  c4  c5
3  19  37   7  17  12
2  17  17  13  45  47
0  47  19  26  38  24
1  41  21  43  21  21

In [48]:
df.sort_values(by=['c2','c5'])

   c6  c3  c2  c4  c5
3  19  37   7  17  12
2  17  17  13  45  47
0  47  19  26  38  24
1  41  21  43  21  21

In [29]:
s = pd.Series(np.random.randint(2,10,6),index=[2,5,4,3,4,6])

In [30]:
s

2    7
5    9
4    6
3    7
4    3
6    2
dtype: int32

In [57]:
s[4]

4    5
4    2
dtype: int32

In [58]:
s.index.is_unique                ## unique if all elemt are not NaN

False

In [3]:
s = pd.Series(np.random.randint(2,10,6),index=[2,5,4,3,7,6])
s

2    8
5    5
4    6
3    6
7    4
6    9
dtype: int32

In [32]:
s.index.is_unique

True

#### Rank

In [16]:
import numpy as np

In [17]:
s = pd.Series(np.random.randint(2,10,6))
s

0    9
1    4
2    6
3    4
4    6
5    8
dtype: int32

In [18]:
s.rank()

0    6.0
1    1.5
2    3.5
3    1.5
4    3.5
5    5.0
dtype: float64

## universal fun. in pandas

In [7]:
import pandas as pd

In [26]:
df= pd.DataFrame([[9,None,4],[37,18,17],[None,35,4],[23,4,12]],columns=['c1','c2','c3'])

In [27]:
# df= pd.DataFrame(np.random.randint(2,50,(250,3)),columns=['c1','c2','c3'])

In [28]:
df

     c1    c2  c3
0   9.0   NaN   4
1  37.0  18.0  17
2   NaN  35.0   4
3  23.0   4.0  12

COUNT fn.

In [35]:
df.count()

c1    3
c2    3
c3    4
dtype: int64

In [36]:
df['c1'].count()

3

SUM fn.

In [30]:
df['c1'].sum()

69.0

In [126]:
df.sum(axis=1)

0    13.0
1    72.0
2    39.0
3    39.0
dtype: float64

In [127]:
df.mean()

c1    23.00
c2    19.00
c3     9.25
dtype: float64

In [32]:
df['c1'].mean()

23.0

In [40]:
df

     c1    c2  c3
0   9.0   NaN   4
1  37.0  18.0  17
2   NaN  35.0   4
3  23.0   4.0  12

In [17]:
df.idxmax()              # index of maxim value 4

c1    1
c2    2
c3    1
dtype: int64

In [18]:
df['c1'].argmax()

1

In [41]:
df['c1'][1]

37.0

In [39]:
df.iloc[0]

c1    9.0
c2    NaN
c3    4.0
Name: 0, dtype: float64

In [19]:
df.cumsum()

         a           b
0      raj       frame
1  rajumar  framedarus

In [135]:
df.describe()

         c1         c2         c3
count   3.0   3.000000   4.000000
mean   23.0  19.000000   9.250000
std    14.0  15.524175   6.396614
min     9.0   4.000000   4.000000
25%    16.0  11.000000   4.000000
50%    23.0  18.000000   8.000000
75%    30.0  26.500000  13.250000
max    37.0  35.000000  17.000000

In [156]:
s=pd.Series([23,55,23,66,14,55,66,88])

In [157]:
s

0    23
1    55
2    23
3    66
4    14
5    55
6    66
7    88
dtype: int64

In [158]:
s.unique()

array([23, 55, 66, 14, 88], dtype=int64)

In [159]:
s.nunique()

5

In [160]:
s.value_counts()

55    2
66    2
23    2
88    1
14    1
dtype: int64

In [161]:
df= pd.DataFrame(np.random.randint(2,7,(10,3)),columns=['c1','c2','c3'])

In [162]:
df

   c1  c2  c3
0   5   5   3
1   5   3   5
2   3   4   2
3   4   5   3
4   4   6   5
5   4   6   5
6   2   4   2
7   4   3   3
8   5   2   5
9   3   5   6

In [167]:
df['c1'].unique()

array([5, 3, 4, 2])

In [168]:
df['c1'].nunique()

4

In [169]:
df['c1'].value_counts()

4    4
5    3
3    2
2    1
Name: c1, dtype: int64